<template>
  <section id="about">
    <v-img
      :max-height="maxHeight"
      :src="require('@/assets/about-img.jpg')"
      class="white--text"
      gradient="to bottom, rgba(11, 28, 61, .9), rgba(0,0,0,.4)"
    >
      <v-responsive
        class="d-flex align-center mx-auto"
        height="100%"
        max-width="200"
        width="100%"
      >
        <base-heading
          size="text-h2"
          title="О нас"
          weight="medium"
        />
      </v-responsive>
    </v-img>
    <v-container class="fill-height px-4 py-12">
      <v-responsive
        class="d-flex align-center mx-auto"
        height="100%"
        max-width="1000"
        width="100%"
      >
        <div
          class="d-flex flex-column justify-space-between align-center"
          style="padding: 20px"
        >
          <h2>Нетронутая волжская природа и развитая инфраструктура</h2>
          <br>
          «Волжанка» – это прекрасное место для отдыха среди могучих вековых сосен на живописном берегу Волги в Ульяновской области.
          Здесь Вы сможете расслабиться и отвлечься от городской суеты, насладиться чистым воздухом, вкусной едой, попариться в роскошной русской бане, весело и активно провести время.
          Это идеальный вариант для отдыха в одиночестве и в кругу друзей, семьи и детей, корпоративных мероприятий и проведения праздников и свадеб.
          Гостям предлагается для размещения 18 комфортабельных, оборудованных собственной кухней уютных коттеджей из натурального бревенчатого сруба. Каждый коттедж имеет отдельную территорию, что обеспечивает покой и уединение.
          Также Вы можете остановиться в одном из 6 номеров в двухэтажном деревянном здании гостиничного комплекса. Все комнаты оснащены холодильником, электрочайником, посудой, телевизором. Собственные ванные оборудованы душевой кабиной.
          <br>
          <br>
          <h2>Мы заботимся о вашем здоровье и приняли меры по предупреждению короновируса на территории загородного комплекса Волжанка!</h2>
          <br>
          <ul>
            <li>Во всем комплексе есть доступ к дезинфицирующим лосьонам.</li>
            <li>В местах общественного пользования установлены бактерицидные лампы.</li>
            <li>Персонал работает только в масках.</li>
            <li>Обрабатываем помещения специальными дезинфицирующими средствами минимум 1 раз в час.</li>
            <li>Отдельно стоящие домики и беседки для организации питания - лучший способ ограничить контакты с большим количеством людей и обезопасить свое здоровье от инфекции!</li>
          </ul>
        </div>
      </v-responsive>
    </v-container>
  </section>
</template>

<script>
  export default {
    name: 'SectionAbout',
    provide: {
      theme: { isDark: true },
    },
    computed: {
      maxHeight () {
        const height = this.$vuetify.breakpoint.mdAndUp ? '30vh' : '20vh'
        return `calc(${height} - ${this.$vuetify.application.top}px)`
      },
    },
  }
</script>
